case_2/system/blockMeshDict

FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)       // 0
    (1 0 0)       // 1
    (1 1 0)       // 2
    (0 1 0)       // 3
    (0 0 0.01)    // 4
    (1 0 0.01)    // 5
    (1 1 0.01)    // 6
    (0 1 0.01)    // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 20 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    movingWall
    {
        type wall;
        faces
        (
            (3 2 6 7)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (0 3 7 4)
            (1 2 6 5)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 7 6 5)
        );
    }
);

// ************************************************************************* //
